Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nations/N32G05x/N32G05x.svd
<?xml version="1.0" encoding="utf-8" standalone="no"?>
<device
    schemaVersion="1.3"
    xmlns:xs="http://www.w3.org/2001/XMLSchema-instance"
    xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
    <vendor>Nationstech Ltd.</vendor>
    <vendorID>NS</vendorID>
    <name>N32G05x</name>
    <version>1.0</version>
    <description>N32G05x</description>

    <addressUnitBits>8</addressUnitBits>
    <width>32</width>
    <size>32</size>
    <access>read-write</access>
    <resetValue>0</resetValue>
    <resetMask>0xffffffff</resetMask>

    <peripherals>
        <peripheral>
            <name>ADC</name>
            <description>analog to digital converter</description>
            <groupName>ADC</groupName>
            <baseAddress>0x40020800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>ADC</name>
                <description>ADC global interrupt</description>
                <value>21</value>
            </interrupt>
            <registers>
                <register>
                    <name>ADC_STS</name>
                    <displayName>ADC_STS</displayName>
                    <description>ADC_STS</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000000f</resetMask>
                    <fields>
                        <field>
                            <name>AWDG</name>
                            <description>AWDG</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ENDC</name>
                            <description>ENDC</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STR</name>
                            <description>STR</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ENDCA</name>
                            <description>ENDCA</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_CTRL1</name>
                    <displayName>ADC_CTRL1</displayName>
                    <description>ADC_CTRL1</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000001ff</resetMask>
                    <fields>
                        <field>
                            <name>AWDGCH</name>
                            <description>AWDGCH</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>ENDIEN</name>
                            <description>ENDIEN</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AWDGIEN</name>
                            <description>AWDGIEN</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AWDGSGLEN</name>
                            <description>AWDGSGLEN</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AWDGERCH</name>
                            <description>AWDGERCH</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>REFSEL</name>
                            <description>REFSEL</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_CTRL2</name>
                    <displayName>ADC_CTRL2</displayName>
                    <description>ADC_CTRL2</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>ON</name>
                            <description>ON</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTU</name>
                            <description>CTU</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field> 
                        <field>
                            <name>ALIG</name>
                            <description>ALIG</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EXTRSEL</name>
                            <description>EXTRSEL</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EXTRTRIG</name>
                            <description>EXTRTRIG</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWSTRRCH</name>
                            <description>SWSTRRCH</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LEN</name>
                            <description>LEN</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SCANMD</name>
                            <description>SCANMD</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>ENDMA</name>
                            <description>ENDMA</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>TEMPEN</name>
                            <description>TEMPEN</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
				<register>
                    <name>ADC_CTRL3</name>
                    <displayName>ADC_CTRL3</displayName>
                    <description>ADC_CTRL3</description>
                    <addressOffset>0xc</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000040</resetValue>
                    <resetMask>0x0000003f</resetMask>
                    <fields>
                        <field>
                            <name>VREFEN</name>
                            <description>VREFEN</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field> 
                        <field>
                            <name>VREFRDY</name>
                            <description>VREFRDY</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RDY</name>
                            <description>RDY</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PDRDY</name>
                            <description>PDRDY</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ENDCAIEN</name>
                            <description>ENDCAIEN</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_SAMPT</name>
                    <displayName>ADC_SAMPT</displayName>
                    <description>ADC_SAMPT</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000001f</resetMask>
                    <fields>
                        <field>
                            <name>SAMP</name>
                            <description>SAMP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>   
                    </fields>
                </register>
                <register>
                    <name>ADC_WDGHIGH</name>
                    <displayName>ADC_WDGHIGH</displayName>
                    <description>ADC_WDGHIGH</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000fff</resetValue>
                    <resetMask>0x00000fff</resetMask>
                    <fields>
                        <field>
                            <name>HTH</name>
                            <description>HTH</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_WDGLOW</name>
                    <displayName>ADC_WDGLOW</displayName>
                    <description>ADC_WDGLOW</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000fff</resetMask>
                    <fields>
                        <field>
                            <name>LTH</name>
                            <description>LTH</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_DAT0</name>
                    <displayName>ADC_DAT0</displayName>
                    <description>ADC_DAT0</description>
                    <addressOffset>0x1c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x001fffff</resetMask>
                    <fields>
                        <field>
                            <name>DAT0</name>
                            <description>DAT0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
						<field>
                            <name>SEQ0</name>
                            <description>SEQ0</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
				<register>
                    <name>ADC_DAT1</name>
                    <displayName>ADC_DAT1</displayName>
                    <description>ADC_DAT1</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x001fffff</resetMask>
                    <fields>
                        <field>
                            <name>DAT1</name>
                            <description>DAT1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
						<field>
                            <name>SEQ1</name>
                            <description>SEQ1</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
				<register>
                    <name>ADC_DAT2</name>
                    <displayName>ADC_DAT2</displayName>
                    <description>ADC_DAT2</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x001fffff</resetMask>
                    <fields>
                        <field>
                            <name>DAT2</name>
                            <description>DAT2</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
						<field>
                            <name>SEQ2</name>
                            <description>SEQ2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
				<register>
                    <name>ADC_DAT3</name>
                    <displayName>ADC_DAT3</displayName>
                    <description>ADC_DAT3</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x001fffff</resetMask>
                    <fields>
                        <field>
                            <name>DAT3</name>
                            <description>DAT3</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
						<field>
                            <name>SEQ3</name>
                            <description>SEQ3</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
				<register>
                    <name>ADC_DAT4</name>
                    <displayName>ADC_DAT4</displayName>
                    <description>ADC_DAT4</description>
                    <addressOffset>0x2c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x001fffff</resetMask>
                    <fields>
                        <field>
                            <name>DAT4</name>
                            <description>DAT4</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
						<field>
                            <name>SEQ4</name>
                            <description>SEQ4</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>				
