Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nations/N32G05x/N32G05x.svd
            </registers>
        </peripheral>

		<peripheral>
            <name>COMP</name>
            <description>comparator</description>
            <groupName>COMP</groupName>
            <baseAddress>0x40002400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>COMP</name>
                <description>COMP interrupt</description>
                <value>31</value>
            </interrupt>
            <registers>
				<register>
                    <name>COMP1_CTRL</name>
                    <displayName>COMP1_CTRL</displayName>
                    <description>COMP1_CTRL</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000fffff</resetMask>
                    <fields>
                        <field>
                            <name>EN</name>
                            <description>EN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INMSEL</name>
                            <description>INMSEL</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>INPSEL</name>
                            <description>INPSEL</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>OUTSEL</name>
                            <description>OUTSEL</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>POL</name>
                            <description>POL</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HYST</name>
                            <description>HYST</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>BLKING</name>
                            <description>BLKING</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>OUT</name>
                            <description>OUT</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FILOUT</name>
                            <description>FILOUT</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
				<register>
                    <name>COMP1_FILC</name>
                    <displayName>COMP1_FILC</displayName>
                    <description>COMP1_FILC</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000007ff</resetMask>
                    <fields>
                        <field>
                            <name>FILEN</name>
                            <description>FILEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>THRESH</name>
                            <description>THRESH</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>SAMPW</name>
                            <description>SAMPW</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP1_FILP</name>
                    <displayName>COMP1_FILP</displayName>
                    <description>COMP1_FILP</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>CLKPSC</name>
                            <description>CLKPSC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
				<register>
                    <name>COMP2_CTRL</name>
                    <displayName>COMP2_CTRL</displayName>
                    <description>COMP2_CTRL</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000fffff</resetMask>
                    <fields>
                        <field>
                            <name>EN</name>
                            <description>EN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INMSEL</name>
                            <description>INMSEL</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>INPSEL</name>
                            <description>INPSEL</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>OUTSEL</name>
                            <description>OUTSEL</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>POL</name>
                            <description>POL</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HYST</name>
                            <description>HYST</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>BLKING</name>
                            <description>BLKING</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>OUT</name>
                            <description>OUT</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FILOUT</name>
                            <description>FILOUT</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
				<register>
                    <name>COMP2_FILC</name>
                    <displayName>COMP2_FILC</displayName>
                    <description>COMP2_FILC</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000007ff</resetMask>
                    <fields>
                        <field>
                            <name>FILEN</name>
                            <description>FILEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>THRESH</name>
                            <description>THRESH</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>SAMPW</name>
                            <description>SAMPW</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP2_FILP</name>
                    <displayName>COMP2_FILP</displayName>
                    <description>COMP2_FILP</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>CLKPSC</name>
                            <description>CLKPSC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
				<register>
                    <name>COMP3_CTRL</name>
                    <displayName>COMP3_CTRL</displayName>
                    <description>COMP3_CTRL</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000fffff</resetMask>
                    <fields>
                        <field>
                            <name>EN</name>
                            <description>EN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INMSEL</name>
                            <description>INMSEL</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>INPSEL</name>
                            <description>INPSEL</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>OUTSEL</name>
                            <description>OUTSEL</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>POL</name>
                            <description>POL</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HYST</name>
                            <description>HYST</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>BLKING</name>
                            <description>BLKING</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>OUT</name>
                            <description>OUT</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FILOUT</name>
                            <description>FILOUT</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
				<register>
                    <name>COMP3_FILC</name>
                    <displayName>COMP3_FILC</displayName>
                    <description>COMP3_FILC</description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000007ff</resetMask>
                    <fields>
                        <field>
                            <name>FILEN</name>
                            <description>FILEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>THRESH</name>
                            <description>THRESH</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>SAMPW</name>
                            <description>SAMPW</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP3_FILP</name>
                    <displayName>COMP3_FILP</displayName>
                    <description>COMP3_FILP</description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>CLKPSC</name>
                            <description>CLKPSC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
				<register>
                    <name>COMP4_CTRL</name>
                    <displayName>COMP4_CTRL</displayName>
                    <description>COMP4_CTRL</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000fffff</resetMask>
                    <fields>
                        <field>
                            <name>EN</name>
                            <description>EN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INMSEL</name>
                            <description>INMSEL</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>INPSEL</name>
                            <description>INPSEL</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>OUTSEL</name>
                            <description>OUTSEL</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>POL</name>
                            <description>POL</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HYST</name>
                            <description>HYST</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>BLKING</name>
                            <description>BLKING</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>OUT</name>
                            <description>OUT</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FILOUT</name>
                            <description>FILOUT</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
				<register>
                    <name>COMP4_FILC</name>
                    <displayName>COMP4_FILC</displayName>
                    <description>COMP4_FILC</description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000007ff</resetMask>
                    <fields>
                        <field>
                            <name>FILEN</name>
                            <description>FILEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>THRESH</name>
                            <description>THRESH</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>SAMPW</name>
                            <description>SAMPW</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP4_FILP</name>
                    <displayName>COMP4_FILP</displayName>
                    <description>COMP4_FILP</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>CLKPSC</name>
                            <description>CLKPSC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
				<register>
                    <name>COMP_OTIMEN</name>
                    <displayName>COMP_OTIMEN</displayName>
                    <description>COMP_OTIMEN</description>
                    <addressOffset>0x70</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>CMP2XO</name>
                            <description>CMP2XO</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>CMP4XO</name>
                            <description>CMP4XO</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
				<register>
                    <name>COMP_LOCK</name>
                    <displayName>COMP_LOCK</displayName>
                    <description>COMP_LOCK</description>
                    <addressOffset>0x84</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000000F</resetMask>
                    <fields>
                        <field>
                            <name>CMP1LK</name>
                            <description>CMP1LK</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>CMP2LK</name>
                            <description>CMP2LK</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>CMP3LK</name>
                            <description>CMP3LK</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>CMP4LK</name>
                            <description>CMP4LK</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
