Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nations/N32G05x/N32G05x.svd
                <register>
                    <name>COMP_INTEN</name>
                    <displayName>COMP_INTEN</displayName>
                    <description>COMP_INTEN</description>
                    <addressOffset>0x8C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000001</resetMask>
                    <fields>
                        <field>
                            <name>CMP1IEN</name>
                            <description>CMP1IEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>CMP2IEN</name>
                            <description>CMP2IEN</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>CMP3IEN</name>
                            <description>CMP3IEN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>CMP4IEN</name>
                            <description>CMP4IEN</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP_INTSTS</name>
                    <displayName>COMP_INTSTS</displayName>
                    <description>COMP_INTSTS</description>
                    <addressOffset>0x90</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000000F</resetMask>
                    <fields>
                        <field>
                            <name>CMP1IS</name>
                            <description>CMP1IS</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>CMP2IS</name>
                            <description>CMP2IS</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>CMP3IS</name>
                            <description>CMP3IS</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>CMP4IS</name>
                            <description>CMP4IS</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMP_INVREF</name>
                    <displayName>COMP_INVREF</displayName>
                    <description>COMP_INVREF</description>
                    <addressOffset>0x94</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000003ff</resetMask>
                    <fields>
                        <field>
                            <name>VV1EN</name>
                            <description>VV1EN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VV1TRM</name>
                            <description>VV1TRM</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
						<field>
                            <name>VV2EN</name>
                            <description>VV2EN</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VV2TRM</name>
                            <description>VV2TRM</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
				<register>
                    <name>COMP_OSEL</name>
                    <displayName>COMP_OSEL</displayName>
                    <description>COMP_OSEL</description>
                    <addressOffset>0x98</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000000F</resetMask>
                    <fields>
                        <field>
                            <name>CMP1OEN</name>
                            <description>CMP1OEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>CMP2OEN</name>
                            <description>CMP2OEN</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>CMP3OEN</name>
                            <description>CMP3OEN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>CMP4OEN</name>
                            <description>CMP4OEN</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
