Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nations/N32G05x/N32G05x.svd
            </registers>
        </peripheral>
		
        <peripheral>
            <name>CRC</name>
            <description>cyclic redundancy check</description>
            <groupName>CRC</groupName>
            <baseAddress>0x40023000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CRC16CTRL</name>
                    <displayName>CRC16CTRL</displayName>
                    <description>CRC16CTRL</description>
                    <addressOffset>0xc</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000007</resetMask>
                    <fields>
                        <field>
                            <name>ENDHL</name>
                            <description>ENDHL</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLR</name>
                            <description>CLR</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CRC16DAT</name>
                    <displayName>CRC16DAT</displayName>
                    <description>CRC16DAT</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                        <field>
                            <name>CRC16DAT</name>
                            <description>CRC16DAT</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CRC16D</name>
                    <displayName>CRC16D</displayName>
                    <description>CRC16D</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>CRC16D</name>
                            <description>CRC16D</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LRC</name>
                    <displayName>LRC</displayName>
                    <description>LRC</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                        <field>
                            <name>LRCDAT</name>
                            <description>LRCDAT</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>

		<peripheral>
            <name>DAC</name>
            <description>digital to analog converter</description>
            <groupName>DAC</groupName>
            <baseAddress>0x40002000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>DAC_CTRL</name>
                    <displayName>DAC_CTRL</displayName>
                    <description>DAC_CTRL</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00007dff</resetMask>
                    <fields>
                        <field>
                            <name>CHEN</name>
                            <description>CHEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMAEN</name>
                            <description>DMAEN</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BEN</name>
                            <description>BEN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TEN</name>
                            <description>TEN</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MASEL</name>
                            <description>MASEL</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>BDASEL</name>
                            <description>BDASEL</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>WEN</name>
                            <description>WEN</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TSEL</name>
                            <description>TSEL</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DAC_SOTTR</name>
                    <displayName>DAC_SOTTR</displayName>
                    <description>DAC_SOTTR</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000001</resetMask>
                    <fields>
                        <field>
                            <name>TREN</name>
                            <description>TREN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
				<register>
                    <name>DAC_DATO</name>
                    <displayName>DAC_DATO</displayName>
                    <description>DAC_DATO</description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000fff</resetMask>
                    <fields>
                        <field>
                            <name>DACCHDO</name>
                            <description>DACCHDO</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
				<register>
                    <name>DAC_DR8CH</name>
                    <displayName>DAC_DR8CH</displayName>
                    <description>DAC_DR8CH</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                        <field>
                            <name>DACCHD</name>
                            <description>DACCHD</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
				<register>
                    <name>DAC_DL12CH</name>
                    <displayName>DAC_DL12CH</displayName>
                    <description>DAC_DL12CH</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000fff0</resetMask>
                    <fields>
                        <field>
                            <name>DACCHD</name>
                            <description>DACCHD</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DAC_DR12CH</name>
                    <displayName>DAC_DR12CH</displayName>
                    <description>DAC_DR12CH</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000fff</resetMask>
                    <fields>
                        <field>
                            <name>DACCHD</name>
                            <description>DACCHD</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
