Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nations/N32G05x/N32G05x.svd
            </registers>
        </peripheral>

        <peripheral>
            <name>DMA</name>
            <description>Direct memory access controller</description>
            <groupName>DMA</groupName>
            <baseAddress>0x40020000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>DMA_Channel1_2</name>
                <description>DMA channel1 channel2 interrupt</description>
                <value>10</value>
            </interrupt>
            <interrupt>
                <name>DMA_Channel3_4_5</name>
                <description>DMA channel3 channel4 channel5 interrupt</description>
                <value>11</value>
            </interrupt>
            <registers>
                <register>
                    <name>DMA_INTSTS</name>
                    <displayName>DMA_INTSTS</displayName>
                    <description>DMA_INTSTS</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>GLBF1</name>
                            <description>GLBF1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXCF1</name>
                            <description>TXCF1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTXF1</name>
                            <description>HTXF1</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERRF1</name>
                            <description>ERRF1</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GLBF2</name>
                            <description>GLBF2</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXCF2</name>
                            <description>TXCF2</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTXF2</name>
                            <description>HTXF2</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERRF2</name>
                            <description>ERRF2</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GLBF3</name>
                            <description>GLBF3</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXCF3</name>
                            <description>TXCF3</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTXF3</name>
                            <description>HTXF3</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERRF3</name>
                            <description>ERRF3</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GLBF4</name>
                            <description>GLBF4</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXCF4</name>
                            <description>TXCF4</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTXF4</name>
                            <description>HTXF4</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERRF4</name>
                            <description>ERRF4</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GLBF5</name>
                            <description>GLBF5</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXCF5</name>
                            <description>TXCF5</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTXF5</name>
                            <description>HTXF5</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERRF5</name>
                            <description>ERRF5</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_INTCLR</name>
                    <displayName>DMA_INTCLR</displayName>
                    <description>DMA_INTCLR</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CGLBF1</name>
                            <description>CGLBF1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTXCF1</name>
                            <description>CTXCF1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHTXF1</name>
                            <description>CHTXF1</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CERRF1</name>
                            <description>CERRF1</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CGLBF2</name>
                            <description>CGLBF2</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTXCF2</name>
                            <description>CTXCF2</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHTXF2</name>
                            <description>CHTXF2</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CERRF2</name>
                            <description>CERRF2</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CGLBF3</name>
                            <description>CGLBF3</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTXCF3</name>
                            <description>CTXCF3</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHTXF3</name>
                            <description>CHTXF3</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CERRF3</name>
                            <description>CERRF3</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CGLBF4</name>
                            <description>CGLBF4</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTXCF4</name>
                            <description>CTXCF4</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHTXF4</name>
                            <description>CHTXF4</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CERRF4</name>
                            <description>CERRF4</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CGLBF5</name>
                            <description>CGLBF5</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTXCF5</name>
                            <description>CTXCF5</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHTXF5</name>
                            <description>CHTXF5</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CERRF5</name>
                            <description>CERRF5</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>                     
                    </fields>
                </register>
                <register>
                    <name>DMA_CHCFG1</name>
                    <displayName>DMA_CHCFG1</displayName>
                    <description>DMA_CHCFG1</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00007fff</resetMask>
                    <fields>
                        <field>
                            <name>CHEN</name>
                            <description>CHEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXCIE</name>
                            <description>TXCIE</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTXIE</name>
                            <description>HTXIE</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERRIE</name>
                            <description>ERRIE</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DIR</name>
                            <description>DIR</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CIRC</name>
                            <description>CIRC</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PINC</name>
                            <description>PINC</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MINC</name>
                            <description>MINC</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PSIZE</name>
                            <description>PSIZE</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MSIZE</name>
                            <description>MSIZE</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PRIOLVL</name>
                            <description>PRIOLVL</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MEM2MEM</name>
                            <description>MEM2MEM</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_TXNUM1</name>
                    <displayName>DMA_TXNUM1</displayName>
                    <description>DMA_TXNUM1</description>
                    <addressOffset>0xc</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>NDTX</name>
                            <description>NDTX</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_PADDR1</name>
                    <displayName>DMA_PADDR1</displayName>
                    <description>DMA_PADDR1</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>ADDR</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_MADDR1</name>
                    <displayName>DMA_MADDR1</displayName>
                    <description>DMA_MADDR1</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>ADDR</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_CHSEL1</name>
                    <displayName>DMA_CHSEL1</displayName>
                    <description>DMA_CHSEL1</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000003f</resetMask>
                    <fields>
                        <field>
                            <name>CH_SEL</name>
                            <description>CH_SEL</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_CHCFG2</name>
                    <displayName>DMA_CHCFG2</displayName>
                    <description>DMA_CHCFG2</description>
                    <addressOffset>0x1c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00007fff</resetMask>
                    <fields>
                        <field>
                            <name>CHEN</name>
                            <description>CHEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXCIE</name>
                            <description>TXCIE</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTXIE</name>
                            <description>HTXIE</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERRIE</name>
                            <description>ERRIE</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DIR</name>
                            <description>DIR</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CIRC</name>
                            <description>CIRC</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PINC</name>
                            <description>PINC</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MINC</name>
                            <description>MINC</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PSIZE</name>
                            <description>PSIZE</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MSIZE</name>
                            <description>MSIZE</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PRIOLVL</name>
                            <description>PRIOLVL</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MEM2MEM</name>
                            <description>MEM2MEM</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
