Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nations/N32G05x/N32G05x.svd
                <register>
                    <name>DMA_CHSEL5</name>
                    <displayName>DMA_CHSEL5</displayName>
                    <description>DMA_CHSEL5</description>
                    <addressOffset>0x68</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000003f</resetMask>
                    <fields>
                        <field>
                            <name>CH_SEL</name>
                            <description>CH_SEL</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
		
        <peripheral>
            <name>EXTI</name>
            <description>external interrupt/event controller</description>
            <groupName>EXTI</groupName>
            <baseAddress>0x40010400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>EXTI0_1</name>
                <description>EXTI0/1 interrupt</description>
                <value>6</value>
            </interrupt>
            <interrupt>
                <name>EXTI2_3</name>
                <description>EXTI2/3 interrupt</description>
                <value>7</value>
            </interrupt>
            <interrupt>
                <name>EXTI4_15</name>
                <description>EXTI4/5/6/7/8/9/10/11/12/13/14/15 interrupt</description>
                <value>8</value>
            </interrupt>           
            <registers>
		        <register>
                    <name>EXTI_EMASK</name>
                    <displayName>EXTI_EMASK</displayName>
                    <description>EXTI_EMASK</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x001fffff</resetMask>
                    <fields>
			            <field>
                            <name>EMASK0</name>
                            <description>EMASK0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK1</name>
                            <description>EMASK1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK2</name>
                            <description>EMASK2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK3</name>
                            <description>EMASK3</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK4</name>
                            <description>EMASK4</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK5</name>
                            <description>EMASK5</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK6</name>
                            <description>EMASK6</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK7</name>
                            <description>EMASK7</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK8</name>
                            <description>EMASK8</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK9</name>
                            <description>EMASK9</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK10</name>
                            <description>EMASK10</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK11</name>
                            <description>EMASK11</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK12</name>
                            <description>EMASK12</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK13</name>
                            <description>EMASK13</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK14</name>
                            <description>EMASK14</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK15</name>
                            <description>EMASK15</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK16</name>
                            <description>EMASK16</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK17</name>
                            <description>EMASK17</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK18</name>
                            <description>EMASK18</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK19</name>
                            <description>EMASK19</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK20</name>
                            <description>EMASK20</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field> 
                    </fields>
                </register>
                <register>
                    <name>EXTI_IMASK</name>
                    <displayName>EXTI_IMASK</displayName>
                    <description>EXTI_IMASK</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x001fffff</resetMask>
                    <fields>
			            <field>
                            <name>IMASK0</name>
                            <description>IMASK0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK1</name>
                            <description>IMASK1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK2</name>
                            <description>IMASK2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK3</name>
                            <description>IMASK3</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK4</name>
                            <description>IMASK4</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK5</name>
                            <description>IMASK5</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK6</name>
                            <description>IMASK6</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK7</name>
                            <description>IMASK7</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK8</name>
                            <description>IMASK8</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK9</name>
                            <description>IMASK9</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK10</name>
                            <description>IMASK10</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK11</name>
                            <description>IMASK11</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK12</name>
                            <description>IMASK12</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK13</name>
                            <description>IMASK13</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK14</name>
                            <description>IMASK14</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK15</name>
                            <description>IMASK15</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK16</name>
                            <description>IMASK16</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK17</name>
                            <description>IMASK17</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK18</name>
                            <description>IMASK18</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK19</name>
                            <description>IMASK19</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK20</name>
                            <description>IMASK20</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
		        <register>
                    <name>EXTI_FT_CFG</name>
                    <displayName>EXTI_FT_CFG</displayName>
                    <description>EXTI_FT_CFG</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x001fffff</resetMask>
                    <fields>
			            <field>
                            <name>FT_CFG0</name>
                            <description>FT_CFG0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FT_CFG1</name>
                            <description>FT_CFG1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FT_CFG2</name>
                            <description>FT_CFG2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FT_CFG3</name>
                            <description>FT_CFG3</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FT_CFG4</name>
                            <description>FT_CFG4</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FT_CFG5</name>
                            <description>FT_CFG5</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FT_CFG6</name>
                            <description>FT_CFG6</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FT_CFG7</name>
                            <description>FT_CFG7</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FT_CFG8</name>
                            <description>FT_CFG8</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FT_CFG9</name>
                            <description>FT_CFG9</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FT_CFG10</name>
                            <description>FT_CFG10</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FT_CFG11</name>
                            <description>FT_CFG11</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FT_CFG12</name>
                            <description>FT_CFG12</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FT_CFG13</name>
                            <description>FT_CFG13</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FT_CFG14</name>
                            <description>FT_CFG14</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FT_CFG15</name>
                            <description>FT_CFG15</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FT_CFG16</name>
                            <description>FT_CFG16</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FT_CFG17</name>
                            <description>FT_CFG17</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FT_CFG18</name>
                            <description>FT_CFG18</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FT_CFG19</name>
                            <description>FT_CFG19</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FT_CFG20</name>
                            <description>FT_CFG20</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
