Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nations/N32G05x/N32G05x.svd
				<register>
                    <name>GPIOx_PLOCK</name>
                    <displayName>GPIOx_PLOCK</displayName>
                    <description>GPIOx_PLOCK</description>
                    <addressOffset>0x1c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0001ffff</resetMask>
                    <fields>
                        <field>
                            <name>PLOCK0</name>
                            <description>PLOCK0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLOCK1</name>
                            <description>PLOCK1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLOCK2</name>
                            <description>PLOCK2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLOCK3</name>
                            <description>PLOCK3</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLOCK4</name>
                            <description>PLOCK4</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLOCK5</name>
                            <description>PLOCK5</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLOCK6</name>
                            <description>PLOCK6</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLOCK7</name>
                            <description>PLOCK7</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLOCK8</name>
                            <description>PLOCK8</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLOCK9</name>
                            <description>PLOCK9</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLOCK10</name>
                            <description>PLOCK10</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLOCK11</name>
                            <description>PLOCK11</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLOCK12</name>
                            <description>PLOCK12</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLOCK13</name>
                            <description>PLOCK13</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLOCK14</name>
                            <description>PLOCK14</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLOCK15</name>
                            <description>PLOCK15</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLOCKK</name>
                            <description>PLOCKK</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
				<register>
                    <name>GPIOx_AFL</name>
                    <displayName>GPIOx_AFL</displayName>
                    <description>GPIOx_AFL</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0xffffffff</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>AFSEL0</name>
                            <description>AFSEL0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>AFSEL1</name>
                            <description>AFSEL1</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>AFSEL2</name>
                            <description>AFSEL2</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>AFSEL3</name>
                            <description>AFSEL3</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>AFSEL4</name>
                            <description>AFSEL4</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>AFSEL5</name>
                            <description>AFSEL5</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>AFSEL6</name>
                            <description>AFSEL6</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>AFSEL7</name>
                            <description>AFSEL7</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>                        
                    </fields>
                </register>				
				<register>
                    <name>GPIOx_AFH</name>
                    <displayName>GPIOx_AFH</displayName>
                    <description>GPIOx_AFH</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0xf00fffff</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>AFSEL8</name>
                            <description>AFSEL8</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>AFSEL9</name>
                            <description>AFSEL9</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>AFSEL10</name>
                            <description>AFSEL10</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>AFSEL11</name>
                            <description>AFSEL11</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>AFSEL12</name>
                            <description>AFSEL12</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>AFSEL13</name>
                            <description>AFSEL13</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>AFSEL14</name>
                            <description>AFSEL14</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>AFSEL15</name>
                            <description>AFSEL15</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
					</fields>
                </register>				
                <register>
                    <name>GPIOx_PBC</name>
                    <displayName>GPIOx_PBC</displayName>
                    <description>GPIOx_PBC</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>PBC0</name>
                            <description>PBC0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PBC1</name>
                            <description>PBC1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PBC2</name>
                            <description>PBC2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PBC3</name>
                            <description>PBC3</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PBC4</name>
                            <description>PBC4</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PBC5</name>
                            <description>PBC5</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PBC6</name>
                            <description>PBC6</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PBC7</name>
                            <description>PBC7</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PBC8</name>
                            <description>PBC8</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PBC9</name>
                            <description>PBC9</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PBC10</name>
                            <description>PBC10</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PBC11</name>
                            <description>PBC11</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PBC12</name>
                            <description>PBC12</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PBC13</name>
                            <description>PBC13</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PBC14</name>
                            <description>PBC14</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PBC15</name>
                            <description>PBC15</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>                
                <register>
                    <name>GPIOx_DS</name>
                    <displayName>GPIOx_DS</displayName>
                    <description>GPIOx_DS</description>
                    <addressOffset>0x2c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>DS0</name>
                            <description>DS0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DS1</name>
                            <description>DS1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DS2</name>
                            <description>DS2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DS3</name>
                            <description>DS3</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DS4</name>
                            <description>DS4</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DS5</name>
                            <description>DS5</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DS6</name>
                            <description>DS6</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DS7</name>
                            <description>DS7</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DS8</name>
                            <description>DS8</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DS9</name>
                            <description>DS9</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DS10</name>
                            <description>DS10</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DS11</name>
                            <description>DS11</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DS12</name>
                            <description>DS12</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DS13</name>
                            <description>DS13</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DS14</name>
                            <description>DS14</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DS15</name>
                            <description>DS15</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>                
