Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nations/N32G05x/N32G05x.svd
            </registers>
        </peripheral>
		
        <peripheral derivedFrom="GPIOA">
            <name>GPIOB</name>
            <baseAddress>0x40010C00</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPIOA">
            <name>GPIOC</name>
            <baseAddress>0x40011000</baseAddress>
        </peripheral>
		<peripheral derivedFrom="GPIOA">
            <name>GPIOD</name>
            <baseAddress>0x40011C00</baseAddress>
        </peripheral>
		
		<peripheral>
            <name>AFIO</name>
            <description>Alternate function I/O</description>
            <groupName>AFIO</groupName>
            <baseAddress>0x40010000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>AFIO_CFG</name>
                    <displayName>AFIO_CFG</displayName>
                    <description>AFIO_CFG</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00fff800</resetMask>
                    <fields>
						<field>
                            <name>IOFLITCFG</name>
                            <description>IOFLITCFG</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>EXTI_ETRR</name>
                            <description>EXTI_ETRR</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
						<field>
                            <name>SPI1_NSS</name>
                            <description>SPI1_NSS</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>SPI2_NSS</name>
                            <description>SPI2_NSS</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>SPI3_NSS</name>
                            <description>SPI3_NSS</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>                
                <register>
                    <name>AFIO_EXTI_CFG0</name>
                    <displayName>AFIO_EXTI_CFG0</displayName>
                    <description>AFIO_EXTI_CFG0</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>EXTI0_CFG</name>
                            <description>EXTI0_CFG</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EXTI1_CFG</name>
                            <description>EXTI1_CFG</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EXTI2_CFG</name>
                            <description>EXTI2_CFG</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EXTI3_CFG</name>
                            <description>EXTI3_CFG</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AFIO_EXTI_CFG1</name>
                    <displayName>AFIO_EXTI_CFG1</displayName>
                    <description>AFIO_EXTI_CFG1</description>
                    <addressOffset>0xc</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>EXTI4_CFG</name>
                            <description>EXTI4_CFG</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EXTI5_CFG</name>
                            <description>EXTI5_CFG</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EXTI6_CFG</name>
                            <description>EXTI6_CFG</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EXTI7_CFG</name>
                            <description>EXTI7_CFG</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AFIO_EXTI_CFG2</name>
                    <displayName>AFIO_EXTI_CFG2</displayName>
                    <description>AFIO_EXTI_CFG2</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>EXTI8_CFG</name>
                            <description>EXTI8_CFG</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EXTI9_CFG</name>
                            <description>EXTI9_CFG</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EXTI10_CFG</name>
                            <description>EXTI10_CFG</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EXTI11_CFG</name>
                            <description>EXTI11_CFG</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AFIO_EXTI_CFG3</name>
                    <displayName>AFIO_EXTI_CFG3</displayName>
                    <description>AFIO_EXTI_CFG3</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>EXTI12_CFG</name>
                            <description>EXTI12_CFG</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EXTI13_CFG</name>
                            <description>EXTI13_CFG</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EXTI14_CFG</name>
                            <description>EXTI14_CFG</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EXTI15_CFG</name>
                            <description>EXTI15_CFG</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>                
                </register>
				<register>
                    <name>AFIO_DIGEFT_CFG1</name>
                    <displayName>AFIO_DIGEFT_CFG1</displayName>
                    <description>AFIO_DIGEFT_CFG1</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>PA0DIGEFTEN</name>
                            <description>PA0DIGEFTEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA1DIGEFTEN</name>
                            <description>PA1DIGEFTEN</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA2DIGEFTEN</name>
                            <description>PA2DIGEFTEN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA3DIGEFTEN</name>
                            <description>PA3DIGEFTEN</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA4DIGEFTEN</name>
                            <description>PA4DIGEFTEN</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA5DIGEFTEN</name>
                            <description>PA5DIGEFTEN</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA6DIGEFTEN</name>
                            <description>PA6DIGEFTEN</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA7DIGEFTEN</name>
                            <description>PA7DIGEFTEN</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA8DIGEFTEN</name>
                            <description>PA8DIGEFTEN</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>PA9DIGEFTEN</name>
                            <description>PA9DIGEFTEN</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>PA10DIGEFTEN</name>
                            <description>PA10DIGEFTEN</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA11DIGEFTEN</name>
                            <description>PA11DIGEFTEN</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA12DIGEFTEN</name>
                            <description>PA12DIGEFTEN</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>PA13DIGEFTEN</name>
                            <description>PA13DIGEFTEN</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>PA14DIGEFTEN</name>
                            <description>PA14DIGEFTEN</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA15DIGEFTEN</name>
                            <description>PA15DIGEFTEN</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB0DIGEFTEN</name>
                            <description>PB0DIGEFTEN</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB1DIGEFTEN</name>
                            <description>PB1DIGEFTEN</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB2DIGEFTEN</name>
                            <description>PB2DIGEFTEN</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB3DIGEFTEN</name>
                            <description>PB3DIGEFTEN</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB4DIGEFTEN</name>
                            <description>PB4DIGEFTEN</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB5DIGEFTEN</name>
                            <description>PB5DIGEFTEN</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>PB6DIGEFTEN</name>
                            <description>PB6DIGEFTEN</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB7DIGEFTEN</name>
                            <description>PB7DIGEFTEN</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>PB8DIGEFTEN</name>
                            <description>PB8DIGEFTEN</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>PB9DIGEFTEN</name>
                            <description>PB9DIGEFTEN</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB10DIGEFTEN</name>
                            <description>PB10DIGEFTEN</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB11DIGEFTEN</name>
                            <description>PB11DIGEFTEN</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB12DIGEFTEN</name>
                            <description>PB12DIGEFTEN</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB13DIGEFTEN</name>
                            <description>PB13DIGEFTEN</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB14DIGEFTEN</name>
                            <description>PB14DIGEFTEN</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB15DIGEFTEN</name>
                            <description>PB15DIGEFTEN</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
