Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nations/N32G05x/N32G05x.svd
                <register>
                    <name>AFIO_DIGEFT_CFG2</name>
                    <displayName>AFIO_DIGEFT_CFG2</displayName>
                    <description>AFIO_DIGEFT_CFG2</description>
                    <addressOffset>0x1c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
						<field>
                            <name>PC0DIGEFTEN</name>
                            <description>PC0DIGEFTEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PC1DIGEFTEN</name>
                            <description>PC1DIGEFTEN</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PC2DIGEFTEN</name>
                            <description>PC2DIGEFTEN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PC3DIGEFTEN</name>
                            <description>PC3DIGEFTEN</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PC4DIGEFTEN</name>
                            <description>PC4DIGEFTEN</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PC5DIGEFTEN</name>
                            <description>PC5DIGEFTEN</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PC6DIGEFTEN</name>
                            <description>PC6DIGEFTEN</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PC7DIGEFTEN</name>
                            <description>PC7DIGEFTEN</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PC8DIGEFTEN</name>
                            <description>PC8DIGEFTEN</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>PC9DIGEFTEN</name>
                            <description>PC9DIGEFTEN</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>PC10DIGEFTEN</name>
                            <description>PC10DIGEFTEN</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PC11DIGEFTEN</name>
                            <description>PC11DIGEFTEN</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PC12DIGEFTEN</name>
                            <description>PC12DIGEFTEN</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PC13DIGEFTEN</name>
                            <description>PC13DIGEFTEN</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PC14DIGEFTEN</name>
                            <description>PC14DIGEFTEN</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PC15DIGEFTEN</name>
                            <description>PC15DIGEFTEN</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PD0DIGEFTEN</name>
                            <description>PD0DIGEFTEN</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>PD4DIGEFTEN</name>
                            <description>PD4DIGEFTEN</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PD5DIGEFTEN</name>
                            <description>PD5DIGEFTEN</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>PD6DIGEFTEN</name>
                            <description>PD6DIGEFTEN</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PD7DIGEFTEN</name>
                            <description>PD7DIGEFTEN</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>PD8DIGEFTEN</name>
                            <description>PD8DIGEFTEN</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>PD9DIGEFTEN</name>
                            <description>PD9DIGEFTEN</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PD10DIGEFTEN</name>
                            <description>PD10DIGEFTEN</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PD11DIGEFTEN</name>
                            <description>PD11DIGEFTEN</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PD12DIGEFTEN</name>
                            <description>PD12DIGEFTEN</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PD13DIGEFTEN</name>
                            <description>PD13DIGEFTEN</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PD14DIGEFTEN</name>
                            <description>PD14DIGEFTEN</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PD15DIGEFTEN</name>
                            <description>PD15DIGEFTEN</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>                
