Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nations/N32G05x/N32G05x.svd
            </registers>			
        </peripheral>
	
		<peripheral>
            <name>I2C1</name>
            <description>Inter integrated circuit</description>
            <groupName>I2C</groupName>
            <baseAddress>0x40005400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>I2C1</name>
                <description>I2C1 global interrupt</description>
                <value>23</value>
            </interrupt>
            <registers>
                <register>
                    <name>I2C_CTRL1</name>
                    <displayName>I2C_CTRL1</displayName>
                    <description>I2C_CTRL1</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x04400000</resetValue>
                    <resetMask>0x78003FFF</resetMask>
                    <fields>
                        <field>
                            <name>EN</name>
                            <description>EN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SMBMODE</name>
                            <description>SMBMODE</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SMBTYPE</name>
                            <description>SMBTYPE</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ARPEN</name>
                            <description>ARPEN</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PECEN</name>
                            <description>PECEN</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GCEN</name>
                            <description>GCEN</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NOEXTEND</name>
                            <description>NOEXTEND</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STARTGEN</name>
                            <description>STARTGEN</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STOPGEN</name>
                            <description>STOPGEN</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ACKEN</name>
                            <description>ACKEN</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ACKPOS</name>
                            <description>ACKPOS</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEC</name>
                            <description>PEC</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SMBALERT</name>
                            <description>SMBALERT</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWRESET</name>
                            <description>SWRESET</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>HTOSEL</name>
                            <description>HTOSEL</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
						<field>
                            <name>LTOSEL</name>
                            <description>LTOSEL</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2C_CTRL2</name>
                    <displayName>I2C_CTRL2</displayName>
                    <description>I2C_CTRL2</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x40000000</resetValue>
                    <resetMask>0x7C00F17F</resetMask>
                    <fields>
                        <field>
                            <name>CLKFREQ</name>
                            <description>CLKFREQ</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>DMALAST</name>
                            <description>DMALAST</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BUFINTEN</name>
                            <description>BUFINTEN</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVTINTEN</name>
                            <description>EVTINTEN</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERRINTEN</name>
                            <description>ERRINTEN</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMAEN</name>
                            <description>DMAEN</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>SDALTOINTEN</name>
                            <description>SDALTOINTEN</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>SCLHTOINTEN</name>
                            <description>SCLHTOINTEN</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>SCLLTOINTEN</name>
                            <description>SCLLTOINTEN</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>HTOEN</name>
                            <description>HTOEN</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>LTOEN</name>
                            <description>LTOEN</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2C_OADDR1</name>
                    <displayName>I2C_OADDR1</displayName>
                    <description>I2C_OADDR1</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x83ff</resetMask>
                    <fields>
                        <field>
                            <name>ADDR0</name>
                            <description>ADDR0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADDR</name>
                            <description>ADDR</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>ADDR_H</name>
                            <description>ADDR_H</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>ADDRMODE</name>
                            <description>ADDRMODE</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2C_OADDR2</name>
                    <displayName>I2C_OADDR2</displayName>
                    <description>I2C_OADDR2</description>
                    <addressOffset>0xc</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x00ff</resetMask>
                    <fields>
                        <field>
                            <name>DUALEN</name>
                            <description>DUALEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADDR2</name>
                            <description>ADDR2</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2C_DAT</name>
                    <displayName>I2C_DAT</displayName>
                    <description>I2C_DAT</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x00ff</resetMask>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>DATA</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2C_STS1</name>
                    <displayName>I2C_STS1</displayName>
                    <description>I2C_STS1</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x03805F7F</resetMask>
                    <fields>
                        <field>
                            <name>STARTBF</name>
                            <description>STARTBF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADDRF</name>
                            <description>ADDRF</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BSF</name>
                            <description>BSF</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STOPF</name>
                            <description>STOPF</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXDATNE</name>
                            <description>RXDATNE</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXDATE</name>
                            <description>TXDATE</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADDR10F</name>
                            <description>ADDR10F</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ACKFAIL</name>
                            <description>ACKFAIL</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ARLOST</name>
                            <description>ARLOST</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BUSERR</name>
                            <description>BUSERR</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OVERRUN</name>
                            <description>OVERRUN</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PECERR</name>
                            <description>PECERR</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SMBALERT</name>
                            <description>SMBALERT</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>SDALTO</name>
                            <description>SDALTO</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>SCLHTO</name>
                            <description>SCLHTO</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>SCLLTO</name>
                            <description>SCLLTO</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2C_STS2</name>
                    <displayName>I2C_STS2</displayName>
                    <description>I2C_STS2</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000fff7</resetMask>
                    <fields>
                        <field>
                            <name>BUSY</name>
                            <description>BUSY</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MSMODE</name>
                            <description>MSMODE</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TRF</name>
                            <description>TRF</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GCALLADDR</name>
                            <description>GCALLADDR</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DUALFLAG</name>
                            <description>DUALFLAG</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SMBDADDR</name>
                            <description>SMBDADDR</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SMBHADDR</name>
                            <description>SMBHADDR</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PECVAL</name>
                            <description>PECVAL</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2C_CLKCTRL</name>
                    <displayName>I2C_CLKCTRL</displayName>
                    <description>I2C_CLKCTRL</description>
                    <addressOffset>0x1c</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xcfff</resetMask>
                    <fields>
                        <field>
                            <name>CLKCTRL</name>
                            <description>CLKCTRL</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>FSMODE</name>
                            <description>FSMODE</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DUTY</name>
                            <description>DUTY</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>I2C_TMRISE</name>
                    <displayName>I2C_TMRISE</displayName>
                    <description>I2C_TMRISE</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x003f</resetMask>
                    <fields>
                        <field>
                            <name>TMRISE</name>
                            <description>TMRISE</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
				<register>
                    <name>I2C_BYTENUM</name>
                    <displayName>I2C_BYTENUM</displayName>
                    <description>I2C_BYTENUM</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x00ff</resetMask>
                    <fields>
                        <field>
                            <name>BYTENUM</name>
                            <description>BYTENUM</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>14</bitWidth>
                        </field>
						<field>
                            <name>RXFSEL</name>
                            <description>RXFSEL</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>BYTENUMEN</name>
                            <description>BYTENUMEN</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
