Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nations/N32G05x/N32G05x.svd
				<register>
                    <name>I2C_GFLTRCTRL</name>
                    <displayName>I2C_GFLTRCTRL</displayName>
                    <description>I2C_GFLTRCTRL</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>SDADFW</name>
                            <description>SDADFW</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>SCLDFW</name>
                            <description>SCLDFW</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>SDAAFW</name>
                            <description>SDAAFW</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SDAAFENN</name>
                            <description>SDAAFENN</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SCLAFW</name>
                            <description>SCLAFW</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SCLAFENN</name>
                            <description>SCLAFENN</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral derivedFrom="I2C1">
            <name>I2C2</name>
            <baseAddress>0x40005800</baseAddress>
            <interrupt>
                <name>I2C2</name>
                <description>I2C2 Global interrupt</description>
                <value>24</value>
            </interrupt>  
		</peripheral>

        <peripheral>
            <name>IWDG</name>
            <description>Independent watchdog</description>
            <groupName>IWDG</groupName>
            <baseAddress>0x40003000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>IWDG_KEY</name>
                    <displayName>IWDG_KEY</displayName>
                    <description>IWDG_KEY</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>KEYV</name>
                            <description>KEYV</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IWDG_PREDIV</name>
                    <displayName>IWDG_PREDIV</displayName>
                    <description>IWDG_PREDIV</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000007</resetMask>
                    <fields>
                        <field>
                            <name>PD</name>
                            <description>PD</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IWDG_RELV</name>
                    <displayName>IWDG_RELV</displayName>
                    <description>IWDG_RELV</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000fff</resetValue>
                    <resetMask>0x00000fff</resetMask>
                    <fields>
                        <field>
                            <name>REL</name>
                            <description>REL</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IWDG_STS</name>
                    <displayName>IWDG_STS</displayName>
                    <description>IWDG_STS</description>
                    <addressOffset>0xc</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>PVU</name>
                            <description>PVU</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CRVU</name>
                            <description>CRVU</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>RUNFREF</name>
                            <description>RUNFREF</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>LPFREF</name>
                            <description>LPFREF</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
				<register>
                    <name>IWDG_FREEZE</name>
                    <displayName>IWDG_FREEZE</displayName>
                    <description>IWDG_FREEZE</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>LPRERV</name>
                            <description>LPRERV</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
