Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nations/N32G05x/N32G05x.svd
            </registers>		
	    </peripheral>

		<peripheral>
            <name>LCD</name>
            <description>Liquid Crystal Display</description>
            <groupName>LCD</groupName>
            <baseAddress>0x40003C00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>LCD</name>
                <description>LCD global interrupt</description>
                <value>29</value>
            </interrupt>
            <registers>
                <register>
                    <name>LCD_CTRL</name>
                    <displayName>LCD_CTRL</displayName>
                    <description>LCD_CTRL</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000017f</resetMask>
                    <fields>
                        <field>
                            <name>LCDEN</name>
                            <description>LCDEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VSEL</name>
                            <description>VSEL</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DUTY</name>
                            <description>DUTY</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>BIAS</name>
                            <description>BIAS</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>	
                        <field>
                            <name>BUFEN</name>
                            <description>BUFEN</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>																			
                    </fields>
                </register>
                <register>
                    <name>LCD_FCTRL</name>
                    <displayName>LCD_FCTRL</displayName>
                    <description>LCD_FCTRL</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x07ffffbf</resetMask>
                    <fields>
                        <field>
                            <name>HDEN</name>
                            <description>HDEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SOFIE</name>
                            <description>SOFIE</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UDDIE</name>
                            <description>UDDIE</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PULSEON</name>
                            <description>PULSEON</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>DEAD</name>
                            <description>DEAD</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CONTRAST</name>
                            <description>CONTRAST</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>BLINKF</name>
                            <description>BLINKF</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>BLINK</name>
                            <description>BLINK</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DIV</name>
                            <description>DIV</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>PRES</name>
                            <description>PRES</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>							
                    </fields>
                </register>	
                <register>
                    <name>LCD_STS</name>
                    <displayName>LCD_STS</displayName>
                    <description>LCD_STS</description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000020</resetValue>
                    <resetMask>0x0000003f</resetMask>
                    <fields>
                        <field>
                            <name>ENSTS</name>
                            <description>ENSTS</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SOF</name>
                            <description>SOF</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UDR</name>
                            <description>UDR</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UDD</name>
                            <description>UDD</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RDY</name>
                            <description>RDY</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FCRSF</name>
                            <description>FCRSF</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                    </fields>
                </register>	
                <register>
                    <name>LCD_CLR</name>
                    <displayName>LCD_CLR</displayName>
                    <description>LCD_CLR</description>
                    <addressOffset>0x0c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000000a</resetMask>
                    <fields>
                        <field>
                            <name>SOFCLR</name>
                            <description>SOFCLR</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UDDCLR</name>
                            <description>UDDCLR</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LCD_RAM1_COM0</name>
                    <displayName>LCD_RAM1_COM0</displayName>
                    <description>LCD_RAM1_COM0</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>S0</name>
                            <description>S0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S1</name>
                            <description>S1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S2</name>
                            <description>S2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S3</name>
                            <description>S3</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S4</name>
                            <description>S4</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S5</name>
                            <description>S5</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S6</name>
                            <description>S6</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S7</name>
                            <description>S7</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S8</name>
                            <description>S8</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S9</name>
                            <description>S9</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S10</name>
                            <description>S10</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S11</name>
                            <description>S11</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S12</name>
                            <description>S12</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S13</name>
                            <description>S13</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S14</name>
                            <description>S14</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S15</name>
                            <description>S15</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S16</name>
                            <description>S16</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S17</name>
                            <description>S17</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S18</name>
                            <description>S18</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S19</name>
                            <description>S19</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S20</name>
                            <description>S20</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S21</name>
                            <description>S21</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S22</name>
                            <description>S22</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S23</name>
                            <description>S23</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S24</name>
                            <description>S24</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S25</name>
                            <description>S25</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S26</name>
                            <description>S26</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S27</name>
                            <description>S27</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S28</name>
                            <description>S28</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S29</name>
                            <description>S29</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S30</name>
                            <description>S30</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S31</name>
                            <description>S31</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LCD_RAM2_COM0</name>
                    <displayName>LCD_RAM2_COM0</displayName>
                    <description>LCD_RAM2_COM0</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000001f</resetMask>
                    <fields>
                        <field>
                            <name>S32</name>
                            <description>S32</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S33</name>
                            <description>S33</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S34</name>
                            <description>S34</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S35</name>
                            <description>S35</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>S36</name>
                            <description>S36</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
