Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nations/N32G05x/N32G05x.svd
			</registers>
        </peripheral>

        <peripheral>
            <name>PWR</name>
            <description>Power control</description>
            <groupName>PWR</groupName>
            <baseAddress>0x40007000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>PVD</name>
                <description>PVD through EXTI line detection interrupt</description>
                <value>1</value>
            </interrupt>
            <registers>
                <register>
                    <name>PWR_CTRL</name>
                    <displayName>PWR_CTRL</displayName>
                    <description>PWR_CTRL</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000621</resetValue>
                    <resetMask>0x000007fe</resetMask>
                    <fields>
                        <field>
                            <name>PVDINTEN</name>
                            <description>PVDINTEN</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PVDFILEN</name>
                            <description>PVDFILEN</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PVDCNT</name>
                            <description>PVDCNT</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>NRSTPOL</name>
                            <description>NRSTPOL</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PDRS</name>
                            <description>PDRS</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PLS</name>
                            <description>PLS</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>PVDEN</name>
                            <description>PVDEN</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLRDBGPDF</name>
                            <description>CLRDBGPDF</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLRWKUPF</name>
                            <description>CLRWKUPF</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PDSTP</name>
                            <description>PDSTP</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IWDGRSTEN</name>
                            <description>IWDGRSTEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>					
                    </fields>
                </register>
                <register>
                    <name>PWR_CTRLSTS</name>
                    <displayName>PWR_CTRLSTS</displayName>
                    <description>PWR_CTRLSTS</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000800</resetValue>
                    <resetMask>0x00000f07</resetMask>
                    <fields>
                        <field>
                            <name>WKUPPOL</name>
                            <description>WKUPPOL</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WKUP1EN</name>
                            <description>WKUP1EN</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WKUP0EN</name>
                            <description>WKUP0EN</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PVDO</name>
                            <description>PVDO</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBGPDF</name>
                            <description>DBGPDF</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WKUPF</name>
                            <description>WKUPF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PWR_CTRL2</name>
                    <displayName>PWR_CTRL2</displayName>
                    <description>PWR_CTRL2</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000400</resetValue>
                    <resetMask>0x00000400</resetMask>
                    <fields>
                        <field>
                            <name>LVRKEY</name>
                            <description>LVRKEY</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>LVRO</name>
                            <description>LVRO</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LVRLS</name>
                            <description>LVRLS</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>LVREN</name>
                            <description>LVREN</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LVRRSTEN</name>
                            <description>LVRRSTEN</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LVRFILEN</name>
                            <description>LVRFILEN</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LVRCNT</name>
                            <description>LVRCNT</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PWR_CTRL3</name>
                    <displayName>PWR_CTRL3</displayName>
                    <description>PWR_CTRL3</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000037f</resetValue>
                    <resetMask>0x00000080</resetMask>
                    <fields>
                        <field>
                            <name>NRSTFILEN</name>
                            <description>NRSTFILEN</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NRSTCNT</name>
                            <description>NRSTCNT</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>PDRSEL</name>
                            <description>PDRSEL</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSIEN</name>
                            <description>LSIEN</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PWR_CTRL4</name>
                    <displayName>PWR_CTRL4</displayName>
                    <description>PWR_CTRL4</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000020</resetValue>
                    <resetMask>0x00000073</resetMask>
                    <fields>
                        <field>
                            <name>RUNF</name>
                            <description>RUNF</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STBFLH</name>
                            <description>STBFLH</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FLHWKUP</name>
                            <description>FLHWKUP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                    </fields>
                </register>
                <register>
                    <name>PWR_CTRL5</name>
                    <displayName>PWR_CTRL5</displayName>
                    <description>PWR_CTRL5</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000004</resetValue>
                    <resetMask>0x000000c0</resetMask>
                    <fields>
                        <field>
                            <name>STPMRSEL</name>
                            <description>STPMRSEL</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PWR_CTRL6</name>
                    <displayName>PWR_CTRL6</displayName>
                    <description>PWR_CTRL6</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000c0</resetMask>
                    <fields>
                        <field>
                            <name>STPMREN</name>
                            <description>STPMREN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
	                </register>
                <register>		
	                <name>DBG_CTRL</name>
                    <displayName>DBG_CTRL</displayName>
                    <description>DBG_CTRL</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00079f06</resetMask>
                    <fields>
                        <field>
                            <name>TIM2STP</name>
                            <description>TIM2STP</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM4STP</name>
                            <description>TIM4STP</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM6STP</name>
                            <description>TIM6STP</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM5STP</name>
                            <description>TIM5STP</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2C2TIMOUT</name>
                            <description>I2C2TIMOUT</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2C1TIMOUT</name>
                            <description>I2C1TIMOUT</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CANSTP</name>
                            <description>CANSTP</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM3STP</name>
                            <description>TIM3STP</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM1STP</name>
                            <description>TIM1STP</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WWDGSTP</name>
                            <description>WWDGSTP</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IWDGSTP</name>
                            <description>IWDGSTP</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PD</name>
                            <description>PD</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STOP</name>
                            <description>STOP</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLEEP</name>
                            <description>SLEEP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
	            </register>
