Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nations/N32G05x/N32G05x.svd
            </registers>	
        </peripheral>

        <peripheral>
            <name>RCC</name>
            <description>Reset and clock control</description>
            <groupName>RCC</groupName>
            <baseAddress>0x40021000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>RCC</name>
                <description>RCC interrupt</description>
                <value>5</value>
            </interrupt>
            <registers>
                <register>
                    <name>RCC_CTRL</name>
                    <displayName>RCC_CTRL</displayName>
                    <description>RCC_CTRL</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00800083</resetValue>
                    <resetMask>0x03cb00fb</resetMask>
                    <fields>
                        <field>
                            <name>HSIEN</name>
                            <description>HSIEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSIRDF</name>
                            <description>HSIRDF</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSI24MRDF</name>
                            <description>HSI24MRDF</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSITRIM</name>
                            <description>HSITRIM</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>HSEEN</name>
                            <description>HSEEN</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSERDF</name>
                            <description>HSERDF</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>HSEBP</name>
                            <description>HSEBP</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLKSSEN</name>
                            <description>CLKSSEN</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSERDTM</name>
                            <description>HSERDTM</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PLLBP</name>
                            <description>PLLBP</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLLOUTEN</name>
                            <description>PLLOUTEN</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                        <field>
                            <name>PLLEN</name>
                            <description>PLLEN</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLLRDF</name>
                            <description>PLLRDF</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LKUPRSTEN</name>
                            <description>LKUPRSTEN</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                    </fields>
                </register>
                <register>
                    <name>RCC_CFG</name>
                    <displayName>RCC_CFG</displayName>
                    <description>RCC_CFG</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x20000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SCLKSW</name>
                            <description>SCLKSW</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SCLKSTS0</name>
                            <description>SCLKSTS0</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AHBPRES</name>
                            <description>AHBPRES</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>APB1PRES</name>
                            <description>APB1PRES</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>APB2PRES</name>
                            <description>APB2PRES</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SCLKSTS1</name>
                            <description>SCLKSTS1</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SCLKSTS2</name>
                            <description>SCLKSTS2</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLLMULFCT</name>
                            <description>PLLMULFCT</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>PLLPRE</name>
                            <description>PLLPRE</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PLLOUTDIV</name>
                            <description>PLLOUTDIV</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>						
                        <field>
                            <name>PLLSRC</name>
                            <description>PLLSRC</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCO</name>
                            <description>MCO</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>MCOPRES</name>
                            <description>MCOPRES</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCC_CLKINT</name>
                    <displayName>RCC_CLKINT</displayName>
                    <description>RCC_CLKINT</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00bf7fbf</resetMask>
                    <fields>
                        <field>
                            <name>LSIRDIF</name>
                            <description>LSIRDIF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSIRDIF</name>
                            <description>HSIRDIF</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSERDIF</name>
                            <description>HSERDIF</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLLRDIF</name>
                            <description>PLLRDIF</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RAMPERRIF</name>
                            <description>RAMPERRIF</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                        <field>
                            <name>CLKSSIF</name>
                            <description>CLKSSIF</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSIRDIEN</name>
                            <description>LSIRDIEN</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSIRDIEN</name>
                            <description>HSIRDIEN</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSERDIEN</name>
                            <description>HSERDIEN</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLLRDIEN</name>
                            <description>PLLRDIEN</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RAMPERRIEN</name>
                            <description>RAMPERRIEN</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RAMPERRRSTEN</name>
                            <description>RAMPERRRSTEN</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                        <field>
                            <name>LSIRDICLR</name>
                            <description>LSIRDICLR</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSIRDICLR</name>
                            <description>HSIRDICLR</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSERDICLR</name>
                            <description>HSERDICLR</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLLRDICLR</name>
                            <description>PLLRDICLR</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RAMPERRCLR</name>
                            <description>RAMPERRCLR</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                        <field>
                            <name>CLKSSICLR</name>
                            <description>CLKSSICLR</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCC_APB2PRST</name>
                    <displayName>RCC_APB2PRST</displayName>
                    <description>RCC_APB2PRST</description>
                    <addressOffset>0xc</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0002769d</resetMask>
                    <fields>
                        <field>
                            <name>AFIORST</name>
                            <description>AFIORST</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IOPARST</name>
                            <description>IOPARST</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IOPBRST</name>
                            <description>IOPBRST</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IOPCRST</name>
                            <description>IOPCRST</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IOPDRST</name>
                            <description>IOPDRST</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI1RST</name>
                            <description>SPI1RST</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI2RST</name>
                            <description>SPI2RST</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI3RST</name>
                            <description>SPI3RST</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM1RST</name>
                            <description>TIM1RST</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                        <field>
                            <name>TIM2RST</name>
                            <description>TIM2RST</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UART1RST</name>
                            <description>UART1RST</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UART2RST</name>
                            <description>UART2RST</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM3RST</name>
                            <description>TIM3RST</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM4RST</name>
                            <description>TIM4RST</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM5RST</name>
                            <description>TIM5RST</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCC_APB1PRST</name>
                    <displayName>RCC_APB1PRST</displayName>
                    <description>RCC_APB1PRST</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x1066083A</resetMask>
                    <fields>
                        <field>
                            <name>TIM6RST</name>
                            <description>TIM6RST</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BEEPRST</name>
                            <description>BEEPRST</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>COMPRST</name>
                            <description>COMPRST</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LCDRST</name>
                            <description>LCDRST</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                        <field>
                            <name>WWDGRST</name>
                            <description>WWDGRST</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UART3RST</name>
                            <description>UART3RST</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UART4RST</name>
                            <description>UART4RST</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UART5RST</name>
                            <description>UART5RST</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2C1RST</name>
                            <description>I2C1RST</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2C2RST</name>
                            <description>I2C2RST</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CANRST</name>
                            <description>CANRST</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DACRST</name>
                            <description>DACRST</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PWRRST</name>
                            <description>PWRRST</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
