Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nations/N32G05x/N32G05x.svd
                <register>
                    <name>RCC_AHBPCLKEN</name>
                    <displayName>RCC_AHBPCLKEN</displayName>
                    <description>RCC_AHBPCLKEN</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000014</resetValue>
                    <resetMask>0x000010f7</resetMask>
                    <fields>
                        <field>
                            <name>DMAEN</name>
                            <description>DMAEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SRAMEN</name>
                            <description>SRAMEN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FLITFEN</name>
                            <description>FLITFEN</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						 <field>
                            <name>CRCEN</name>
                            <description>CRCEN</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SACEN</name>
                            <description>SACEN</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADCEN</name>
                            <description>ADCEN</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCC_APB2PCLKEN</name>
                    <displayName>RCC_APB2PCLKEN</displayName>
                    <description>RCC_APB2PCLKEN</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000769d</resetMask>
                    <fields>
                        <field>
                            <name>AFIOEN</name>
                            <description>AFIOEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IOPAEN</name>
                            <description>IOPAEN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IOPBEN</name>
                            <description>IOPBEN</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IOPCEN</name>
                            <description>IOPCEN</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IOPDEN</name>
                            <description>IOPDEN</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI1EN</name>
                            <description>SPI1EN</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI2EN</name>
                            <description>SPI2EN</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI3EN</name>
                            <description>SPI3EN</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM1EN</name>
                            <description>TIM1EN</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                        <field>
                            <name>TIM2EN</name>
                            <description>TIM2EN</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UART1EN</name>
                            <description>UART1EN</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UART2EN</name>
                            <description>UART2EN</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM3EN</name>
                            <description>TIM3EN</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM4EN</name>
                            <description>TIM4EN</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM5EN</name>
                            <description>TIM5EN</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCC_APB1PCLKEN</name>
                    <displayName>RCC_APB1PCLKEN</displayName>
                    <description>RCC_APB1PCLKEN</description>
                    <addressOffset>0x1c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x90660B3E</resetMask>
                    <fields>
                        <field>
                            <name>TIM6EN</name>
                            <description>TIM6EN</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BEEPEN</name>
                            <description>BEEPEN</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>COMPEN</name>
                            <description>COMPEN</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>COMPFILTEN</name>
                            <description>COMPFILTEN</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LCDEN</name>
                            <description>LCDEN</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                        <field>
                            <name>WWDGEN</name>
                            <description>WWDGEN</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UART3EN</name>
                            <description>UART3EN</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UART4EN</name>
                            <description>UART4EN</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UART5EN</name>
                            <description>UART5EN</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2C1EN</name>
                            <description>I2C1EN</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2C2EN</name>
                            <description>I2C2EN</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CANEN</name>
                            <description>CANEN</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DACEN</name>
                            <description>DACEN</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PWREN</name>
                            <description>PWREN</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCC_LSCTRL</name>
                    <displayName>RCC_LSCTRL</displayName>
                    <description>RCC_LSCTRL</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000003</resetValue>
                    <resetMask>0x000003ff</resetMask>
                    <fields>
                        <field>
                            <name>LSIEN</name>
                            <description>LSIEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSIRDF</name>
                            <description>LSIRD</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSITRIM</name>
                            <description>LSITRIM</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>RTCSEL</name>
                            <description>RTCSEL</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RTCEN</name>
                            <description>RTCEN</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTCRST</name>
                            <description>RTCRST</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCC_CTRLSTS</name>
                    <displayName>RCC_CTRLSTS</displayName>
                    <description>RCC_CTRLSTS</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000018</resetValue>
                    <resetMask>0x00000fff</resetMask>
                    <fields>
                        <field>
                            <name>RMRSTF</name>
                            <description>RMRSTF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RAMPERRRSTF</name>
                            <description>RAMPERRRSTF</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MMURSTF</name>
                            <description>MMURSTF</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PINRSTF</name>
                            <description>PINRSTF</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PORRSTF</name>
                            <description>PORRSTF</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SFTRSTF</name>
                            <description>SFTRSTF</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IWDGRSTF</name>
                            <description>IWDGRSTF</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WWDGRSTF</name>
                            <description>WWDGRSTF</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LPWRRSTF</name>
                            <description>LPWRRSTF</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMCGBNRSTF</name>
                            <description>EMCGBNRSTF</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMCGBRSTF</name>
                            <description>EMCGBRSTF</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LKUPRSTF</name>
                            <description>LKUPRSTF</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>LVRRSTF</name>
                            <description>LVRRSTF</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                    </fields>
                </register>
                <register>
                    <name>RCC_AHBPRST</name>
                    <displayName>RCC_AHBPRST</displayName>
                    <description>RCC_AHBPRST</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000010a0</resetMask>
                    <fields>
                        <field>
                            <name>SACRST</name>
                            <description>SACRST</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADCRST</name>
                            <description>ADCRST</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCC_CFG2</name>
                    <displayName>RCC_CFG2</displayName>
                    <description>RCC_CFG2</description>
                    <addressOffset>0x2c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00003800</resetValue>
                    <resetMask>0x8ee0fdff</resetMask>
                    <fields>
                        <field>
                            <name>ADCHPRES</name>
                            <description>ADCHPRES</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ADCPLLPRES</name>
                            <description>ADCPLLPRES</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>ADC1MSEL</name>
                            <description>ADC1MSEL</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADC1MPRES</name>
                            <description>ADC1MPRES</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>ADCCLKSEL</name>
                            <description>ADCCLKSEL</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>						
                        <field>
                            <name>LCDCLKSEL</name>
                            <description>LCDCLKSEL</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM6CLKSEL</name>
                            <description>TIM6CLKSEL</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM1CLKSEL</name>
                            <description>TIM1CLKSEL</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                    </fields>
                </register>
