Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nations/N32G05x/N32G05x.svd
				<register>
                    <name>RCC_CFG3</name>
                    <displayName>RCC_CFG3</displayName>
                    <description>RCC_CFG3</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x78050000</resetValue>
                    <resetMask>0x8ee0fdff</resetMask>
                    <fields>
                        <field>
                            <name>GCLKEN</name>
                            <description>GCLKEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GCLKSEL</name>
                            <description>GCLKSEL</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GCLKDONE</name>
                            <description>GCLKDONE</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GCLKDMAEN</name>
                            <description>GCLKDMAEN</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GCLKPRES</name>
                            <description>GCLKPRES</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>						
                        <field>
                            <name>GCLKMNUM</name>
                            <description>GCLKMNUM</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>GCLKNNUM</name>
                            <description>GCLKNNUM</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>						
                    </fields>
                </register>
                <register>
                    <name>RCC_EMCCTRL</name>
                    <displayName>RCC_EMCCTRL</displayName>
                    <description>RCC_EMCCTRL</description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00ffffff</resetMask>
                    <fields>						
                        <field>
                            <name>GBNDET0EN</name>
                            <description>GBNDET0EN</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GBNDET1EN</name>
                            <description>GBNDET1EN</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GBNDET2EN</name>
                            <description>GBNDET2EN</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GBNDET3EN</name>
                            <description>GBNDET3EN</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GBDET0EN</name>
                            <description>GBDET0EN</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GBDET1EN</name>
                            <description>GBDET1EN</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GBDET2EN</name>
                            <description>GBDET2EN</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GBDET3EN</name>
                            <description>GBDET3EN</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>GBN0RST</name>
                            <description>GBN0RST</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GBN1RST</name>
                            <description>GBN1RST</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GBN2RST</name>
                            <description>GBN2RST</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GBN3RST</name>
                            <description>GBN3RST</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GB0RST</name>
                            <description>GB0RST</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GB1RST</name>
                            <description>GB1RST</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GB2RST</name>
                            <description>GB2RST</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GB3RST</name>
                            <description>GB3RST</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                    </fields>
                </register>
