Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nations/N32G05x/N32G05x.svd
				<register>
                    <name>RTC_ALARMA</name>
                    <displayName>RTC_ALARMA</displayName>
                    <description>RTC_ALARMA</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SEU</name>
                            <description>SEU</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>SET</name>
                            <description>SET</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>MASK1</name>
                            <description>MASK1</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MIU</name>
                            <description>MIU</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>MIT</name>
                            <description>MIT</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>MASK2</name>
                            <description>MASK2</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOU</name>
                            <description>HOU</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>HOT</name>
                            <description>HOT</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>APM</name>
                            <description>APM</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MASK3</name>
                            <description>MASK3</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTU</name>
                            <description>DTU</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DTT</name>
                            <description>DTT</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>WKDSEL</name>
                            <description>WKDSEL</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MASK4</name>
                            <description>MASK4</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_PRE</name>
                    <displayName>RTC_PRE</displayName>
                    <description>RTC_PRE</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x007f00ff</resetValue>
                    <resetMask>0x007f7fff</resetMask>
                    <fields>
                        <field>
                            <name>DIVS</name>
                            <description>DIVS</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>15</bitWidth>
                        </field>
                        <field>
                            <name>DIVA</name>
                            <description>DIVA</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
				<register>
                    <name>RTC_ALARMB</name>
                    <displayName>RTC_ALARMB</displayName>
                    <description>RTC_ALARMB</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SEU</name>
                            <description>SEU</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>SET</name>
                            <description>SET</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>MASK1</name>
                            <description>MASK1</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MIU</name>
                            <description>MIU</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>MIT</name>
                            <description>MIT</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>MASK2</name>
                            <description>MASK2</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HOU</name>
                            <description>HOU</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>HOT</name>
                            <description>HOT</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>APM</name>
                            <description>APM</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MASK3</name>
                            <description>MASK3</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTU</name>
                            <description>DTU</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DTT</name>
                            <description>DTT</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>WKDSEL</name>
                            <description>WKDSEL</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MASK4</name>
                            <description>MASK4</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_WKUPT</name>
                    <displayName>RTC_WKUPT</displayName>
                    <description>RTC_WKUPT</description>
                    <addressOffset>0x2c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000ffff</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>WKUPT</name>
                            <description>WKUPT</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
				<register>
                    <name>RTC_TMPCFG</name>
                    <displayName>RTC_TMPCFG</displayName>
                    <description>RTC_TMPCFG</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x002dff9f</resetMask>
                    <fields>
                        <field>
                            <name>TP1EN</name>
                            <description>TP1EN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TP1TRG</name>
                            <description>TP1TRG</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TPINTEN</name>
                            <description>TPINTEN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TP2EN</name>
                            <description>TP2EN</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TP2TRG</name>
                            <description>TP2TRG</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>TP3EN</name>
                            <description>TP3EN</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TP3TRG</name>
                            <description>TP3TRG</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
						</field>
                        <field>
                            <name>TPTS</name>
                            <description>TPTS</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>TPFREQ</name>
                            <description>TPFREQ</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>	
                        <field>
                            <name>TPFLT</name>
                            <description>TPFLT</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>	
                        <field>
                            <name>TPPRCH</name>
                            <description>TPPRCH</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>	
                        <field>
                            <name>TPPUDIS</name>
                            <description>TPPUDIS</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>TP1INTEN</name>
                            <description>TP1INTEN</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>TP1MF</name>
                            <description>TP1MF</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>TP2INTEN</name>
                            <description>TP2INTEN</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>TP2MF</name>
                            <description>TP2MF</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>TP3INTEN</name>
                            <description>TP3INTEN</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>TP3MF</name>
                            <description>TP3MF</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                    </fields>
                </register>	
				<register>
                    <name>RTC_ALRMASS</name>
                    <displayName>RTC_ALRMASS</displayName>
                    <description>RTC_ALRMASS</description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000f7fff</resetMask>
                    <fields>
                        <field>
                            <name>SSV</name>
                            <description>SSV</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>15</bitWidth>
                        </field>
                        <field>
                            <name>MASKSSB</name>
                            <description>MASKSSB</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
				<register>
                    <name>RTC_OPT</name>
                    <displayName>RTC_OPT</displayName>
                    <description>RTC_OPT</description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000001</resetMask>
                    <fields>
                        <field>
                            <name>TYPE</name>
                            <description>TYPE</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
				<register>
                    <name>RTC_ALRMBSS</name>
                    <displayName>RTC_ALRMBSS</displayName>
                    <description>RTC_ALRMBSS</description>
                    <addressOffset>0x3c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000f7fff</resetMask>
                    <fields>
                        <field>
                            <name>SSV</name>
                            <description>SSV</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>15</bitWidth>
                        </field>
                        <field>
                            <name>MASKSSB</name>
                            <description>MASKSSB</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
				<register>
                    <name>RTC_CALIB</name>
                    <displayName>RTC_CALIB</displayName>
                    <description>RTC_CALIB</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                        <field>
                            <name>CM</name>
                            <description>CM</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>9</bitWidth>
                        </field>
                        <field>
                            <name>CW16</name>
                            <description>CW16</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CW8</name>
                            <description>CW8</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CP</name>
                            <description>CP</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
				<register>
                    <name>RTC_TSSS</name>
                    <displayName>RTC_TSSS</displayName>
                    <description>RTC_TSSS</description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>SSE</name>
                            <description>SSE</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_TSD</name>
                    <displayName>RTC_TSD</displayName>
                    <description>RTC_TSD</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00ffff3f</resetMask>
                    <fields>
                        <field>
                            <name>DAU</name>
                            <description>DAU</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DAT</name>
                            <description>DAT</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MOU</name>
                            <description>MOU</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>WDU</name>
                            <description>WDU</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
						<field>
                            <name>MOT</name>
                            <description>MOT</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>YRU</name>
                            <description>YRU</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>YRT</name>
                            <description>YRT</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
