Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nations/N32G05x/N32G05x.svd
            </registers>
        </peripheral>
	
		<peripheral>
            <name>SPI1</name>
            <description>Serial peripheral interface</description>
            <groupName>SPI</groupName>
            <baseAddress>0x40012000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>SPI1</name>
                <description>SPI1 global interrupt</description>
                <value>25</value>
            </interrupt>
			            <registers>
                <register>
                    <name>SPI_CTRL1</name>
                    <displayName>SPI_CTRL1</displayName>
                    <description>SPI_CTRL1</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>BR</name>
                            <description>BR</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CLKPOL</name>
                            <description>CLKPOL</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLKPHA</name>
                            <description>CLKPHA</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MSEL</name>
                            <description>MSEL</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSBFF</name>
                            <description>LSBFF</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DATFF</name>
                            <description>DATFF</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CRCNEXT</name>
                            <description>CRCNEXT</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SSOEN</name>
                            <description>SSEL</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SSEL</name>
                            <description>SSEL</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SSMEN</name>
                            <description>SSMEN</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RONLY</name>
                            <description>RONLY</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BIDIROEN</name>
                            <description>BIDIROEN</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BIDIRMODE</name>
                            <description>BIDIRMODE</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_CTRL2</name>
                    <displayName>SPI_CTRL2</displayName>
                    <description>SPI_CTRL2</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000060ff</resetMask>
                    <fields>
                        <field>
                            <name>SPIEN</name>
                            <description>SPIEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RDMAEN</name>
                            <description>RDMAEN</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TDMAEN</name>
                            <description>TDMAEN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CRCEN</name>
                            <description>CRCEN</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TEINTEN</name>
                            <description>TEINTEN</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RNEINTEN</name>
                            <description>RNEINTEN</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERRINTEN</name>
                            <description>ERRINTEN</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NSSPOL</name>
                            <description>NSSPOL</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CRCSTP</name>
                            <description>CRCSTP</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ROTCINTEN</name>
                            <description>ROTCINTEN</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_STS</name>
                    <displayName>SPI_STS</displayName>
                    <description>SPI_STS</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000101</resetValue>
                    <resetMask>0x0000107f</resetMask>
                    <fields>
                        <field>
                            <name>TE</name>
                            <description>TE</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RNE</name>
                            <description>RNE</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BUSY</name>
                            <description>BUSY</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CRCERR</name>
                            <description>CRCERR</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MODERR</name>
                            <description>MODERR</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OVER</name>
                            <description>OVER</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ROTCF</name>
                            <description>ROTCF</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_DAT</name>
                    <displayName>SPI_DAT</displayName>
                    <description>SPI_DAT</description>
                    <addressOffset>0xc</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>DAT</name>
                            <description>DAT</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_CRCTDAT</name>
                    <displayName>SPI_CRCTDAT</displayName>
                    <description>SPI_CRCTDAT</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>CRCTDAT</name>
                            <description>CRCTDAT</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_CRCRDAT</name>
                    <displayName>SPI_CRCRDAT</displayName>
                    <description>SPI_CRCRDAT</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>CRCRDAT</name>
                            <description>CRCRDAT</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_CRCPOLY</name>
                    <displayName>SPI_CRCPOLY</displayName>
                    <description>SPI_CRCPOLY</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>CRCPOLY</name>
                            <description>CRCPOLY</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
				<register>
                    <name>SPI_CTRL3</name>
                    <displayName>SPI_CTRL3</displayName>
                    <description>SPI_CTRL3</description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000000f</resetMask>
                    <fields>
                        <field>
                            <name>DELAYTIME</name>
                            <description>DELAYTIME</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
