Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nations/N32G05x/N32G05x.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="SPI1">
            <name>SPI2</name>
            <baseAddress>0x40014400</baseAddress>   
            <interrupt>
                <name>SPI2</name>
                <description>SPI2 global interrupt</description>
                <value>22</value>
            </interrupt>         
        </peripheral>
        <peripheral derivedFrom="SPI1">
            <name>SPI3</name>
            <baseAddress>0x40014000</baseAddress>   
            <interrupt>
                <name>SPI3</name>
                <description>SPI3 global interrupt</description>
                <value>27</value>
            </interrupt>         
        </peripheral>

        <peripheral>
            <name>TIM1</name>
            <description>Advanced timer</description>
            <groupName>TIM</groupName>
            <baseAddress>0x40012C00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TIM1_BRK_UP_TRG_COM</name>
                <description>TIM1 Break/Update/Trigger/Commutation interrupt</description>
                <value>13</value>
            </interrupt>
            <interrupt>
                <name>TIM1_CC</name>
                <description>TIM1 Capture Compare interrupt</description>
                <value>14</value>
            </interrupt>
            <registers>
                <register>
                    <name>TIMx_CTRL1</name>
                    <displayName>TIMx_CTRL1</displayName>
                    <description>TIMx_CTRL1</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00038fff</resetMask>
                    <fields>
                        <field>
                            <name>CNTEN</name>
                            <description>CNTEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DIR</name>
                            <description>DIR</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CAMSEL</name>
                            <description>CAMSEL</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>UPRS</name>
                            <description>UPRS</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UPDIS</name>
                            <description>UPDIS</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLKD</name>
                            <description>CLKD</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>ONEPM</name>
                            <description>ONEPM</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ARPEN</name>
                            <description>ARPEN</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LBKPEN</name>
                            <description>LBKPEN</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PBKPEN</name>
                            <description>PBKPEN</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IOMBKPEN</name>
                            <description>IOMBKPEN</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLRSEL</name>
                            <description>CLRSEL</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>COMPBKPEN</name>
                            <description>COMPBKPEN</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>C1SEL</name>
                            <description>C1SEL</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CMODE</name>
                            <description>CMODE</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>ASYMMETRIC</name>
                            <description>ASYMMETRIC</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_CTRL2</name>
                    <displayName>TIMx_CTRL2</displayName>
                    <description>TIMx_CTRL2</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00057ffd</resetMask>
                    <fields>
                        <field>
                            <name>OI1</name>
                            <description>OI1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OI1N</name>
                            <description>OI1N</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OI2</name>
                            <description>OI2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OI2N</name>
                            <description>OI2N</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OI3</name>
                            <description>OI3</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OI3N</name>
                            <description>OI3N</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OI4</name>
                            <description>OI4</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OI4N</name>
                            <description>OI4N</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OI5</name>
                            <description>OI5</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OI6</name>
                            <description>OI6</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MMSEL</name>
                            <description>MMSEL</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>CCUSEL</name>
                            <description>CCUSEL</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCDSEL</name>
                            <description>CCDSEL</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCPCTL</name>
                            <description>CCPCTL</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TI1SEL</name>
                            <description>TI1SEL</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TRIG4</name>
                            <description>TRIG4</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TRIG7</name>
                            <description>TRIG7</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TRIG8</name>
                            <description>TRIG8</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TRIG9</name>
                            <description>TRIG9</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_STS</name>
                    <displayName>TIMx_STS</displayName>
                    <description>TIMx_STS</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000f0f3f</resetMask>
                    <fields>
                        <field>
                            <name>CC1ITF</name>
                            <description>CC1ITF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC2ITF</name>
                            <description>CC2ITF</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC3ITF</name>
                            <description>CC3ITF</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC4ITF</name>
                            <description>CC4ITF</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC5ITF</name>
                            <description>CC5ITF</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC6ITF</name>
                            <description>CC6ITF</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC1OCF</name>
                            <description>CC1OCF</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC2OCF</name>
                            <description>CC2OCF</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC3OCF</name>
                            <description>CC3OCF</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC4OCF</name>
                            <description>CC4OCF</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UDITF</name>
                            <description>UDITF</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>COMITF</name>
                            <description>COMITF</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TITF</name>
                            <description>TITF</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BITF</name>
                            <description>BITF</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_EVTGEN</name>
                    <displayName>TIMx_EVTGEN</displayName>
                    <description>TIMx_EVTGEN</description>
                    <addressOffset>0xc</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000f0f</resetMask>
                    <fields>
                        <field>
                            <name>CC1GN</name>
                            <description>CC1GN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC2GN</name>
                            <description>CC2GN</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC3GN</name>
                            <description>CC3GN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC4GN</name>
                            <description>CC4GN</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UDGN</name>
                            <description>UDGN</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCUDGN</name>
                            <description>CCUDGN</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TGN</name>
                            <description>TGN</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BGN</name>
                            <description>BGN</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_SMCTRL</name>
                    <displayName>TIMx_SMCTRL</displayName>
                    <description>TIMx_SMCTRL</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0001fff7</resetMask>
                    <fields>
                        <field>
                            <name>TSEL</name>
                            <description>TSEL</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SMSEL</name>
                            <description>SMSEL</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>EXTPS</name>
                            <description>EXTPS</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EXCEN</name>
                            <description>EXCEN</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EXTP</name>
                            <description>EXTP</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EXTF</name>
                            <description>EXTF</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>MSMD</name>
                            <description>MSMD</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
