Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nations/N32G05x/N32G05x.svd
                <register>
                    <name>TIMx_DINTEN</name>
                    <displayName>TIMx_DINTEN</displayName>
                    <description>TIMx_DINTEN</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x007f0f0f</resetMask>
                    <fields>
                        <field>
                            <name>CC1IEN</name>
                            <description>CC1IEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC2IEN</name>
                            <description>CC2IEN</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC3IEN</name>
                            <description>CC3IEN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC4IEN</name>
                            <description>CC4IEN</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC1DEN</name>
                            <description>CC1DEN</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC2DEN</name>
                            <description>CC2DEN</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC3DEN</name>
                            <description>CC3DEN</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC4DEN</name>
                            <description>CC4DEN</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UIEN</name>
                            <description>UIEN</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIEN</name>
                            <description>TIEN</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BIEN</name>
                            <description>BIEN</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UDEN</name>
                            <description>UDEN</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>COMDEN</name>
                            <description>COMDEN</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TDEN</name>
                            <description>TDEN</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>COMIEN</name>
                            <description>COMIEN</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_CCMOD1</name>
                    <displayName>TIMx_CCMOD1</displayName>
                    <description>TIMx_CCMOD1</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>CC1SEL</name>
                            <description>CC1SEL</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>OC1PEN</name>
                            <description>OC1PEN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OC1FEN</name>
                            <description>OC1FEN</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OC1CEN</name>
                            <description>OC1CEN</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OC1MD</name>
                            <description>OC1M</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CC2SEL</name>
                            <description>CC2SEL</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>OC2PEN</name>
                            <description>OC2PEN</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OC2FEN</name>
                            <description>OC2FEN</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OC2CEN</name>
                            <description>OC2CEN</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OC2M</name>
                            <description>OC2M</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_CCMOD2</name>
                    <displayName>TIMx_CCMOD2</displayName>
                    <description>TIMx_CCMOD2</description>
                    <addressOffset>0x1c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>CC3SEL</name>
                            <description>CC3SEL</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>OC3PEN</name>
                            <description>OC3PEN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OC3FEN</name>
                            <description>OC3FEN</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OC3CEN</name>
                            <description>OC3CEN</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OC3M</name>
                            <description>OC3M</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CC4SEL</name>
                            <description>CC4SEL</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>OC4PEN</name>
                            <description>OC4PEN</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OC4FEN</name>
                            <description>OC4FEN</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OC4CEN</name>
                            <description>OC4CEN</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OC4M</name>
                            <description>OC4M</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_CCMOD3</name>
                    <displayName>TIMx_CCMOD3</displayName>
                    <description>TIMx_CCMOD3</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0111fcfc</resetMask>
                    <fields>
                        <field>
                            <name>OC5PEN</name>
                            <description>OC5PEN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OC5FEN</name>
                            <description>OC5FEN</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OC5CEN</name>
                            <description>OC5CEN</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OC5MD</name>
                            <description>OC5MD</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>OC6PEN</name>
                            <description>OC6PEN</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OC6FEN</name>
                            <description>OC6FEN</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OC6CEN</name>
                            <description>OC6CEN</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OC6MD</name>
                            <description>OC6MD</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>OC7PEN</name>
                            <description>OC7PEN</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OC8PEN</name>
                            <description>OC8PEN</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OC9PEN</name>
                            <description>OC9PEN</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_CCEN</name>
                    <displayName>TIMx_CCEN</displayName>
                    <description>TIMx_CCEN</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00ccffff</resetMask>
                    <fields>
                        <field>
                            <name>CC1NEN</name>
                            <description>CC1NEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC1NP</name>
                            <description>CC1NP</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC1EN</name>
                            <description>CC1EN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC1P</name>
                            <description>CC1P</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC2NEN</name>
                            <description>CC2NEN</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC2NP</name>
                            <description>CC2NP</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC2EN</name>
                            <description>CC2EN</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC2P</name>
                            <description>CC2P</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC3NEN</name>
                            <description>CC3NEN</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC3NP</name>
                            <description>CC3NP</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC3EN</name>
                            <description>CC3EN</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC3P</name>
                            <description>CC3P</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC4NEN</name>
                            <description>CC4NEN</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC4NP</name>
                            <description>CC4NP</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC4EN</name>
                            <description>CC4EN</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC4P</name>
                            <description>CC4P</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC5EN</name>
                            <description>CC5EN</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC5P</name>
                            <description>CC5P</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC6EN</name>
                            <description>CC6EN</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC6P</name>
                            <description>CC6P</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_CCDAT1</name>
                    <displayName>TIMx_CCDAT1</displayName>
                    <description>TIMx_CCDAT1</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CCDAT1</name>
                            <description>CCDAT1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>CCDDAT1</name>
                            <description>CCDDAT1</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_CCDAT2</name>
                    <displayName>TIMx_CCDAT2</displayName>
                    <description>TIMx_CCDAT2</description>
                    <addressOffset>0x2c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CCDAT2</name>
                            <description>CCDAT2</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>CCDDAT2</name>
                            <description>CCDDAT2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
