Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nations/N32G05x/N32G05x.svd
                <register>
                    <name>TIMx_CCDAT3</name>
                    <displayName>TIMx_CCDAT3</displayName>
                    <description>TIMx_CCDAT3</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CCDAT3</name>
                            <description>CCDAT3</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>CCDDAT3</name>
                            <description>CCDDAT3</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_CCDAT4</name>
                    <displayName>TIMx_CCDAT4</displayName>
                    <description>TIMx_CCDAT4</description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CCDAT4</name>
                            <description>CCDAT4</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>CCDDAT4</name>
                            <description>CCDDAT4</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_CCDAT5</name>
                    <displayName>TIMx_CCDAT5</displayName>
                    <description>TIMx_CCDAT5</description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>CCDAT5</name>
                            <description>CCDAT5</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_CCDAT6</name>
                    <displayName>TIMx_CCDAT6</displayName>
                    <description>TIMx_CCDAT6</description>
                    <addressOffset>0x3c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>CCDAT6</name>
                            <description>CCDAT6</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_PSC</name>
                    <displayName>TIMx_PSC</displayName>
                    <description>TIMx_PSC</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>PSC</name>
                            <description>PSC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_AR</name>
                    <displayName>TIMx_AR</displayName>
                    <description>TIMx_AR</description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000ffff</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>AR</name>
                            <description>AR</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_CNT</name>
                    <displayName>TIMx_CNT</displayName>
                    <description>TIMx_CNT</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>CNT</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
				</register>
                <register>
                    <name>TIMx_REPCNT</name>
                    <displayName>TIMx_REPCNT</displayName>
                    <description>TIMx_REPCNT</description>
                    <addressOffset>0x4c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000ff</resetMask>
                    <fields>
                        <field>
                            <name>REPCNT</name>
                            <description>REPCNT</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_BKDT</name>
                    <displayName>TIMx_BKDT</displayName>
                    <description>TIMx_BKDT</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>DTGN</name>
                            <description>DTGN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>MOEN</name>
                            <description>MOEN</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AOEN</name>
                            <description>AOEN</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BKP</name>
                            <description>BKP</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BKEN</name>
                            <description>BKEN</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OSSI</name>
                            <description>OSSI</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OSSR</name>
                            <description>OSSR</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LCKCFG</name>
                            <description>LCKCFG</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_CCDAT7</name>
                    <displayName>TIMx_CCDAT7</displayName>
                    <description>TIMx_CCDAT7</description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>CCDAT7</name>
                            <description>CCDAT7</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_CCDAT8</name>
                    <displayName>TIMx_CCDAT8</displayName>
                    <description>TIMx_CCDAT8</description>
                    <addressOffset>0x58</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>CCDAT8</name>
                            <description>CCDAT8</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_CCDAT9</name>
                    <displayName>TIMx_CCDAT9</displayName>
                    <description>TIMx_CCDAT9</description>
                    <addressOffset>0x5c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>CCDAT9</name>
                            <description>CCDAT9</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_BKFR</name>
                    <displayName>TIMx_BKFR</displayName>
                    <description>TIMx_BKFR</description>
                    <addressOffset>0x60</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x3f7fffff</resetMask>
                    <fields>
                        <field>
                            <name>PSC</name>
                            <description>PSC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>FILTEN</name>
                            <description>FILTEN</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WSIZE</name>
                            <description>WSIZE</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>THRESH</name>
                            <description>THRESH</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_DCTRL</name>
                    <displayName>TIMx_DCTRL</displayName>
                    <description>TIMx_DCTRL</description>
                    <addressOffset>0x94</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00001f1f</resetMask>
                    <fields>
                        <field>
                            <name>DBLEN</name>
                            <description>DBLEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>DBADDR</name>
                            <description>DBADDR</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_DADDR</name>
                    <displayName>TIMx_DADDR</displayName>
                    <description>TIMx_DADDR</description>
                    <addressOffset>0x98</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>BURST</name>
                            <description>BURST</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
