Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nations/N32G05x/N32G05x.svd
                <register>
                    <name>TIMx_CCMOD2</name>
                    <displayName>TIMx_CCMOD2</displayName>
                    <description>TIMx_CCMOD2</description>
                    <addressOffset>0x1c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>CC3SEL</name>
                            <description>CC3SEL</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>OC3PEN</name>
                            <description>OC3PEN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OC3FEN</name>
                            <description>OC3FEN</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OC3CEN</name>
                            <description>OC3CEN</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OC3M</name>
                            <description>OC3M</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CC4SEL</name>
                            <description>CC4SEL</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>OC4PEN</name>
                            <description>OC4PEN</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OC4FEN</name>
                            <description>OC4FEN</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OC4CEN</name>
                            <description>OC4CEN</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OC4M</name>
                            <description>OC4M</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_CCEN</name>
                    <displayName>TIMx_CCEN</displayName>
                    <description>TIMx_CCEN</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000cccc</resetMask>
                    <fields>
                        <field>
                            <name>CC1EN</name>
                            <description>CC1EN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC1P</name>
                            <description>CC1P</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC2EN</name>
                            <description>CC2EN</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC2P</name>
                            <description>CC2P</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC3EN</name>
                            <description>CC3EN</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC3P</name>
                            <description>CC3P</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC4EN</name>
                            <description>CC4EN</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC4P</name>
                            <description>CC4P</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_CCDAT1</name>
                    <displayName>TIMx_CCDAT1</displayName>
                    <description>TIMx_CCDAT1</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>CCDAT1</name>
                            <description>CCDAT1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_CCDAT2</name>
                    <displayName>TIMx_CCDAT2</displayName>
                    <description>TIMx_CCDAT2</description>
                    <addressOffset>0x2c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>CCDAT2</name>
                            <description>CCDAT2</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_CCDAT3</name>
                    <displayName>TIMx_CCDAT3</displayName>
                    <description>TIMx_CCDAT3</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>CCDAT3</name>
                            <description>CCDAT3</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_CCDAT4</name>
                    <displayName>TIMx_CCDAT4</displayName>
                    <description>TIMx_CCDAT4</description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>CCDAT4</name>
                            <description>CCDAT4</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_PSC</name>
                    <displayName>TIMx_PSC</displayName>
                    <description>TIMx_PSC</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>PSC</name>
                            <description>PSC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_AR</name>
                    <displayName>TIMx_AR</displayName>
                    <description>TIMx_AR</description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000ffff</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>AR</name>
                            <description>AR</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_CNT</name>
                    <displayName>TIMx_CNT</displayName>
                    <description>TIMx_CNT</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>CNT</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
				</register>
                <register>
                    <name>TIMx_C1FILT</name>
                    <displayName>TIMx_C1FILT</displayName>
                    <description>TIMx_C1FILT</description>
                    <addressOffset>0x64</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x3f7fffff</resetMask>
                    <fields>
                        <field>
                            <name>PSC</name>
                            <description>PSC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>FILTEN</name>
                            <description>FILTEN</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WSIZE</name>
                            <description>WSIZE</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>THRESH</name>
                            <description>THRESH</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_C2FILT</name>
                    <displayName>TIMx_C2FILT</displayName>
                    <description>TIMx_C2FILT</description>
                    <addressOffset>0x68</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x3f7fffff</resetMask>
                    <fields>
                        <field>
                            <name>PSC</name>
                            <description>PSC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>FILTEN</name>
                            <description>FILTEN</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WSIZE</name>
                            <description>WSIZE</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>THRESH</name>
                            <description>THRESH</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_C3FILT</name>
                    <displayName>TIMx_C3FILT</displayName>
                    <description>TIMx_C3FILT</description>
                    <addressOffset>0x6c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x3f7fffff</resetMask>
                    <fields>
                        <field>
                            <name>PSC</name>
                            <description>PSC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>FILTEN</name>
                            <description>FILTEN</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WSIZE</name>
                            <description>WSIZE</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>THRESH</name>
                            <description>THRESH</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_C4FILT</name>
                    <displayName>TIMx_C4FILT</displayName>
                    <description>TIMx_C4FILT</description>
                    <addressOffset>0x70</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x3f7fffff</resetMask>
                    <fields>
                        <field>
                            <name>PSC</name>
                            <description>PSC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>FILTEN</name>
                            <description>FILTEN</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WSIZE</name>
                            <description>WSIZE</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>THRESH</name>
                            <description>THRESH</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_FILTO</name>
                    <displayName>TIMx_FILTO</displayName>
                    <description>TIMx_FILTO</description>
                    <addressOffset>0x74</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000000f</resetMask>
                    <fields>
                        <field>
                            <name>C1FILTO</name>
                            <description>C1FILTO</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>C2FILTO</name>
                            <description>C2FILTO</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>C3FILTO</name>
                            <description>C3FILTO</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>C4FILTO</name>
                            <description>C4FILTO</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_INSEL</name>
                    <displayName>TIMx_INSEL</displayName>
                    <description>TIMx_INSEL</description>
                    <addressOffset>0x78</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00001111</resetMask>
                    <fields>
                        <field>
                            <name>C1SEL</name>
                            <description>C1SEL</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>C2SEL</name>
                            <description>C2SEL</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>C3SEL</name>
                            <description>C3SEL</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>C4SEL</name>
                            <description>C4SEL</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_DCTRL</name>
                    <displayName>TIMx_DCTRL</displayName>
                    <description>TIMx_DCTRL</description>
                    <addressOffset>0x94</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00001f1f</resetMask>
                    <fields>
                        <field>
                            <name>DBLEN</name>
                            <description>DBLEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>DBADDR</name>
                            <description>DBADDR</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_DADDR</name>
                    <displayName>TIMx_DADDR</displayName>
                    <description>TIMx_DADDR</description>
                    <addressOffset>0x98</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>BURST</name>
                            <description>BURST</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
