Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nations/N32G05x/N32G05x.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="TIM2">
            <name>TIM3</name>
            <baseAddress>0x40013000</baseAddress>   
            <interrupt>
                <name>TIM3</name>
                <description>TIM3 global interrupt</description>
                <value>16</value>
            </interrupt>         
        </peripheral>
        <peripheral derivedFrom="TIM2">
            <name>TIM4</name>
            <baseAddress>0x40012400</baseAddress>   
            <interrupt>
                <name>TIM4</name>
                <description>TIM4 global interrupt</description>
                <value>12</value>
            </interrupt>         
        </peripheral>
        <peripheral derivedFrom="TIM2">
            <name>TIM5</name>
            <baseAddress>0x40012800</baseAddress>   
            <interrupt>
                <name>TIM5</name>
                <description>TIM5 global interrupt</description>
                <value>18</value>
            </interrupt>         
        </peripheral>
		
        <peripheral>
            <name>TIM6</name>
            <description>Basic timer</description>
            <groupName>TIM</groupName>
            <baseAddress>0x40001000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TIM6</name>
                <description>TIM6 global interrupt</description>
                <value>19</value>
            </interrupt>
            <registers>
                <register>
                    <name>TIMx_CTRL1</name>
                    <displayName>TIMx_CTRL1</displayName>
                    <description>TIMx_CTRL1</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000331</resetMask>
                    <fields>
                        <field>
                            <name>CNTEN</name>
                            <description>CNTEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UPRS</name>
                            <description>UPRS</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UPDIS</name>
                            <description>UPDIS</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ONEPM</name>
                            <description>ONEPM</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ARPEN</name>
                            <description>ARPEN</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_CTRL2</name>
                    <displayName>TIMx_CTRL2</displayName>
                    <description>TIMx_CTRL2</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000f000</resetMask>
                    <fields>
                        <field>
                            <name>MMSEL</name>
                            <description>MMSEL</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_STS</name>
                    <displayName>TIMx_STS</displayName>
                    <description>TIMx_STS</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00010000</resetMask>
                    <fields>
                        <field>
                            <name>UDITF</name>
                            <description>UDITF</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_EVTGEN</name>
                    <displayName>TIMx_EVTGEN</displayName>
                    <description>TIMx_EVTGEN</description>
                    <addressOffset>0xc</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000100</resetMask>
                    <fields>
                        <field>
                            <name>UDGN</name>
                            <description>UDGN</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_DINTEN</name>
                    <displayName>TIMx_DINTEN</displayName>
                    <description>TIMx_DINTEN</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00090000</resetMask>
                    <fields>
                        <field>
                            <name>UIEN</name>
                            <description>UIEN</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UDEN</name>
                            <description>UDEN</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_PSC</name>
                    <displayName>TIMx_PSC</displayName>
                    <description>TIMx_PSC</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>PSC</name>
                            <description>PSC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_AR</name>
                    <displayName>TIMx_AR</displayName>
                    <description>TIMx_AR</description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000ffff</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>AR</name>
                            <description>AR</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMx_CNT</name>
                    <displayName>TIMx_CNT</displayName>
                    <description>TIMx_CNT</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>CNT</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
